# string
# การเข้าถึงข้อมูลใน String 
name = "  aBC  Chirapon : 24    " # index => 0
name2= "chirapon"
print(name[7:15]) # นับมาจากด้านหน้า
print(name[-10:]) # นับมาจากด้านหลัง
count = len(name) #ใช้ในการนับตัวอักษร
print("มีความยากตัวอักษรทั้งหมดกี่ตัวอักษร :", count)

strip = name.strip() # ใช้ในการลบช่องว่างข้างหน้าและข้างหลังออก
lstrip = name.lstrip() # ใช้ในการลบช้องว่างข้างซ้ายออก 
rstrip = name.rstrip() # ใช้ในการลบช้องว่างข้างขวาออก 
print(name) #ก่อน
print(strip,'ใช้ในการลบช่องว่างข้างหน้าและข้างหลังออก') #หลัง
print(lstrip,'ใช้ในการลบช้องว่างข้างซ้ายออก ') #หลัง
print(rstrip,'ใช้ในการลบช้องว่างข้างขวาออก ') #หลัง

print(name.upper(),'เปลี่ยนเป็นตัวพิมพ์ใหญ่') # เปลี่ยนเป็นตัวพิมพ์ใหญ่
print(name.lower(),'เปลี่ยนเป็นตัวพิมพ์เล็ก') # เปลี่ยนเป็นตัวพิมพ์เล็ก

print(name2.capitalize(),'ขึ้นต้นด้วยตัวพิมพ์ใหญ่') # ขึ้นต้นด้วยตัวพิมพ์ใหญ่

print(name.replace(" ","_"),"เปลี่ยนตัวอักษรด้วยการแทนที่") #เปลี่ยนตัวอักษรด้วยการแทนที่
print(name.replace(" ","_",2),"เปลี่ยนตัวอักษรด้วยการแทนที่") #เปลี่ยนตัวอักษรด้วยการแทนที่ (กำหนดตตำแหน่งได้โดยใส่ตัวเลขด้านหลัง)

x = 'pon' in name # not in สามารถใช้ได้เหมือนกัน
if x:
    name = name.replace("pon","PON")
    print(name)